Reports/ОстаткиИОбороты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Report>
		<Properties>
			<Name>ОстаткиИОбороты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоТоварам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порожняя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подробно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/ОстаткиИОбороты/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.Сформировать(ТабДок);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
	    СтандартнаяОбработка = Ложь;
		
		ЗначенияЗаполнения = Новый Структура("Период,Склад,Товар,ПоТоварам,ПоГруппам,Порожняя,Подробно", Отчет.Период, Отчет.Склад, Отчет.Товар, Отчет.ПоТоварам, Отчет.ПоГруппам, Отчет.Порожняя, Истина);
		
		Для Каждого ПараметрРасшифровки Из Расшифровка Цикл
			ЗначенияЗаполнения.Вставить(ПараметрРасшифровки.Ключ, ПараметрРасшифровки.Значение);
		КонецЦикла;
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ОткрытьФорму(ЭтотОбъект.ИмяФормы, ПараметрыФормы,, Новый УникальныйИдентификатор);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
		СтандартнаяОбработка = Истина;
		
		Для Каждого ПараметрЗаполнения Из Параметры.ЗначенияЗаполнения Цикл
			Отчет[ПараметрЗаполнения.Ключ] = ПараметрЗаполнения.Значение;
		КонецЦикла;
		
		СформироватьНаСервере();
	Иначе
		Отчет.Период = ХранилищеНастроекДанныхФорм.Загрузить("Отчет." + ЭтотОбъект.ИмяФормы, "Период");
		Отчет.Склад = ХранилищеНастроекДанныхФорм.Загрузить("Отчет." + ЭтотОбъект.ИмяФормы, "Склад");
		Отчет.Товар = ХранилищеНастроекДанныхФорм.Загрузить("Отчет." + ЭтотОбъект.ИмяФормы, "Товар");
		Отчет.ПоТоварам = ХранилищеНастроекДанныхФорм.Загрузить("Отчет." + ЭтотОбъект.ИмяФормы, "ПоТоварам");
		Отчет.ПоГруппам = ХранилищеНастроекДанныхФорм.Загрузить("Отчет." + ЭтотОбъект.ИмяФормы, "ПоГруппам");
		Отчет.Порожняя = ХранилищеНастроекДанныхФорм.Загрузить("Отчет." + ЭтотОбъект.ИмяФормы, "Порожняя");
		Отчет.Подробно = ХранилищеНастроекДанныхФорм.Загрузить("Отчет." + ЭтотОбъект.ИмяФормы, "Подробно");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗакрытиемНаСервере()
	ХранилищеНастроекДанныхФорм.Сохранить("Отчет." + ЭтотОбъект.ИмяФормы, "Период", Отчет.Период);
	ХранилищеНастроекДанныхФорм.Сохранить("Отчет." + ЭтотОбъект.ИмяФормы, "Склад", Отчет.Склад);
	ХранилищеНастроекДанныхФорм.Сохранить("Отчет." + ЭтотОбъект.ИмяФормы, "Товар", Отчет.Товар);
	ХранилищеНастроекДанныхФорм.Сохранить("Отчет." + ЭтотОбъект.ИмяФормы, "ПоТоварам", Отчет.ПоТоварам);
	ХранилищеНастроекДанныхФорм.Сохранить("Отчет." + ЭтотОбъект.ИмяФормы, "ПоГруппам", Отчет.ПоГруппам);
	ХранилищеНастроекДанныхФорм.Сохранить("Отчет." + ЭтотОбъект.ИмяФормы, "Порожняя", Отчет.Порожняя);
	ХранилищеНастроекДанныхФорм.Сохранить("Отчет." + ЭтотОбъект.ИмяФормы, "Подробно", Отчет.Подробно);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы = Ложь Тогда
		ПередЗакрытиемНаСервере();
	КонецЕсли;
КонецПроцедуры
